[{
        "description": "Negative behavioral response to physiological, environmental, situational, sociological, and emotional stimuli.",
        "name": "Irritability",
        "nicknames": [
            "Anger",
            "Frustration"
        ]
    },
    {
        "description": "Sudden, involuntary contractions that occur in various muscles.",
        "name": "Muscle cramps",
        "nicknames": [
            "Muscle spasms"
        ]

    },
    {
        "description": "Body muscles contract and relax rapidly and repeatedly, resulting in an uncontrolled shaking of the body.",
        "name": "Convulsion",
        "nicknames": [
            "Seizures"
        ]

    }, {
        "name": "Numbness"
    }, {
        "name": "Paresthesia"
    }, {
        "name": "Rash"
    }, {
        "name": "Flushing"
    }, {
        "description": "An uncomfortable, irritating sensation that makes you want to scratch. ou may have Skin itching over certain small areas, such as on an arm or leg, or over your whole body. Skin itching can occur without any other noticeable changes on the skin: redness, bumps, blisters, spots, skin dryness, skin lesions",
        "name": "Pruritus",
        "nicknames": ["Skin itching"]

    }, {
        "name": "Edema",
        "nicknames": ["Swelling"]
    },
    {
        "description": "Any characteristic that acts as a barrier to the cognition process. Cognition is 'the mental action or process of acquiring knowledge and understanding through thought, experience, and the senses.'[1] It encompasses processes such as knowledge, attention, memory and working memory, judgment and evaluation, reasoning and 'computation', problem solving and decision making, comprehension and production of language, etc. Human cognition is conscious and unconscious, concrete or abstract, as well as intuitive (like knowledge of a language) and conceptual (like a model of a language). Cognitive processes use existing knowledge and generate new knowledge.",
        "name": "Cognitive impairment",
        "nicknames": ["Cognitive deficit"]
    }

    // References: https://en.wikipedia.org/wiki/Cognitive_deficit, https://en.wikipedia.org/wiki/Cognition, [1] https://en.oxforddictionaries.com/definition/cognition
]